update log_processor / log_collector with nats
